# Домашнее задание к занятию «1. Введение в Java»

Не забывайте заводить по найденным багам баг-репорты в Github Issue.

В качестве результата пришлите ссылки на ваши GitHub-проекты в личном кабинете студента на сайте [netology.ru](https://netology.ru).

Все задачи этого занятия нужно делать в разных репозиториях.

**Важно**: если у вас что-то не получилось, то оформляйте Issue [по установленным правилам](../report-requirements.md).

**Важно**: не делайте ДЗ всех занятий в одном репозитории! Иначе вам потом придётся достаточно сложно подключать системы Continuous Integration.

## Как сдавать задачи

1. Инициализируйте на своём компьютере пустой Git-репозиторий
1. Добавьте в него готовый файл [.gitignore](../.gitignore)
1. Добавьте в этот же каталог необходимые файлы
1. Сделайте необходимые коммиты
1. Создайте публичный репозиторий на GitHub и свяжите свой локальный репозиторий с удалённым
1. Сделайте пуш (удостоверьтесь, что ваш код появился на GitHub)
1. Ссылку на ваш проект отправьте в личном кабинете на сайте [netology.ru](https://netology.ru)
1. Задачи, отмеченные, как необязательные, можно не сдавать, это не повлияет на получение зачета

## Задача №1 - Money Transfer

### Легенда

Вы устроились на работу в достаточно крупный банк и там произошёл неприятный казус: при пополнении счёта VIP-клиента что-то пошло не так.

Входные данные:
* текущий баланс счёта клиента - переменная типа `int`, значение - 2_000_000_000 (два миллиарда рублей)*
* сумма перевода - переменная типа `int`, значение - 500_000_000 (пятьсот миллионов рублей)
* переменная для хранения итогового значения - тип `int`

Примечание*: Java позволяет для удобочитаемости использовать символ нижнего подчёркивания в числах.

Что вам нужно:
1. Создать базовое приложение (на основании [примера, который рассматривался на лекции](https://github.com/netology-code/javaqa-code/blob/master/1.2_programming/variables/src/Main.java)), позволяющее воспроизвести ситуацию*
1. Проанализировать ситуацию (а конкретно то, что записалось в переменной для хранения итогового значения)
1. Подготовить баг-репорт, в котором нормально описать, что же произошло

**Важно**: в причинах (почему именно так произошло) разбираться не нужно - мы об этом поговорим на лекции.

Примечание*: к сожалению, как всегда, все говорят, что что-то пошло не так, но никто не может объяснить толком, поэтому придётся разбираться вам.

Подготовьте отчёт о проведённом тестировании в [указанном формате](report.md) и разместите его в репозитории. Не забудьте в баг-репортах прикрепить скриншот идеи в режиме отладчика, на котором виден дефект.

Итого: у вас должен быть репозиторий на GitHub, в котором расположен ваш Java-код, а также отчёт о проведённом тестировании и заведены баг-репорты в Issues (если баги есть).

## Задача №2 - Credit Card Number Validator*

**Важно**: это необязательная задача. Её (не)выполнение не влияет на получение зачёта по ДЗ.

### Легенда

Вы попали в небольшой стартап, который помогает осуществлять приём платежей с банковских карт различным организациям.

Стартап находится на самом этапе зарождения, поэтому первое, что они решили сделать - реализовать функциональность валидации номера банковской карты.

Но как всегда бывает в стартапах, программист, который взялся реализовывать эту функциональность, исчез и не отвечает на звонки.

Но от него остались некоторые наработки вот в таком виде:
```java
public class Main {
  public static void main(String[] args) {
    // TODO: подставлять номер карты нужно сюда между двойными кавычками, без пробелов
    String number = "5351719427810741";
    System.out.println(String.format("Result is %s", isValidCardNumber(number) ? "OK" : "FAIL"));
  }

  public static boolean isValidCardNumber(String number) {
    if (number == null) {
      return false;
    }

    if (number.length() != 16) {
      return false;
    }

    long result = 0;
    for (int i = 0; i < number.length(); i++) {
      int digit;
      try {
        digit = Integer.parseInt(number.charAt(i) + "");
      } catch (NumberFormatException e) {
        return false;
      }

      if (i % 2 == 0) {
        digit *= 2;
        if (digit > 9) {
          digit -= 9;
        }
      }
      result += digit;
    }

    return (result != 0) && (result % 10 == 0);
  }
}
```
